app/controllers/animals_controller.rb

  def index
    @animals = Animal.all.order("created_at DESC")
---
SELECT "animals".* FROM "animals" ORDER BY created_at DESC

  def create
    @animal = Animal.new(animal_params)
    if @animal.save
---
INSERT INTO "animals" ("name", "species", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Dog"], ["species", "Canis lupus familiaris"], ["age", 2], ["created_at", "2017-10-02 05:35:56.336267"], ["updated_at", "2017-10-02 05:35:56.336267"]]

  def update
    if @animal.update(animal_params)
---
UPDATE "animals" SET "name" = $1, "updated_at" = $2 WHERE "animals"."id" = $3  [["name", "Muffin"], ["updated_at", "2017-10-02 05:59:26.148880"], ["id", 1]]

  def destroy
    @animal.destroy
---
DELETE FROM "animals" WHERE "animals"."id" = $1  [["id", 1]]

def find_animal
  @animal = Animal.find(params[:id])
---
SELECT  "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]